0xsmirk/mcu_cmsis_svd/Spansion/MB9AFA3xL.svd
        <!-- REGISTER "EPFR08" -->
        <register>
          <name>EPFR08</name>
          <description>Extended pin function setting register 08</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK7B" -->
            <field>
              <name>SCK7B</name>
              <description>SCK7 input/output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT7B" -->
            <field>
              <name>SOT7B</name>
              <description>SOT7B input/output select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN7S" -->
            <field>
              <name>SIN7S</name>
              <description>SIN7S input select bit</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK6B" -->
            <field>
              <name>SCK6B</name>
              <description>SCK6 input/output select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT6B" -->
            <field>
              <name>SOT6B</name>
              <description>SOT6B input/output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN6S" -->
            <field>
              <name>SIN6S</name>
              <description>SIN6S input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK5B" -->
            <field>
              <name>SCK5B</name>
              <description>SCK5 input/output select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT5B" -->
            <field>
              <name>SOT5B</name>
              <description>SOT5B input/output select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN5S" -->
            <field>
              <name>SIN5S</name>
              <description>SIN5S input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK4B" -->
            <field>
              <name>SCK4B</name>
              <description>SCK4 input/output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT4B" -->
            <field>
              <name>SOT4B</name>
              <description>SOT4B input/output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN4S" -->
            <field>
              <name>SIN4S</name>
              <description>SIN4S input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR09" -->
        <register>
          <name>EPFR09</name>
          <description>Extended pin function setting register 09</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000F000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADTRG0S" -->
            <field>
              <name>ADTRG0S</name>
              <description>ADTRG0 input select bit</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR14" -->
        <register>
          <name>EPFR14</name>
          <description>Extended pin function setting register 14</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CEC1B" -->
            <field>
              <name>CEC1B</name>
              <description>CEC1 Input/Output Select bit</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CEC0B" -->
            <field>
              <name>CEC0B</name>
              <description>CEC0 Input/Output Select bit</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR0" -->
        <register>
          <name>PZR0</name>
          <description>Port Pseudo Open Drain Setting Register 0</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00003000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PZR0</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PZR0</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR6" -->
        <register>
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PZR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR8" -->
        <register>
          <name>PZR8</name>
          <description>Port Pseudo Open Drain Setting Register 8</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000006</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PZR8</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PZR8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
